Re500_run1/simulation/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    wallInlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
480
(
0.99521732
1.042581
1.042581
0.99521732
0.99521732
1.042581
1.042581
0.99521732
...
)
;
    }
    wallCollector
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.98093959
1.0254528
1.0254528
0.98093959
0.96647443
1.0097265
1.0097265
0.96647443
...
)
;
    }
    wallThroat
    {
        type            calculated;
        value           nonuniform List<scalar> 
640
(
0.57442413
0.60184713
0.60184713
0.57442413
0.57442413
0.60184713
0.60184713
0.57442413
...
)
;
    }
    wallOutlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
960
(
1.0139648
1.0139112
1.0139112
1.0139648
1.0116288
1.0115749
1.0115749
1.0116288
...
)
;
    }
    stepExpansion
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
2.7607972
2.760797
2.760797
2.7607972
2.7602564
2.7602562
2.7602562
2.7602564
...
)
;
    }
}


// ************************************************************************* //
